## Kaggle games Dataset

 We will be using the [automobiles Dataset](https://www.kaggle.com/nisargpatel/automobiles/data) from Kaggle.


1. symboling: -3, -2, -1, 0, 1, 2, 3. 
2. normalized-losses: continuous from 65 to 256. 
3. make: 
alfa-romero, audi, bmw, chevrolet, dodge, honda, 
isuzu, jaguar, mazda, mercedes-benz, mercury, 
mitsubishi, nissan, peugot, plymouth, porsche, 
renault, saab, subaru, toyota, volkswagen, volvo 

4. fuel-type: diesel, gas. 
5. aspiration: std, turbo. 
6. num-of-doors: four, two. 
7. body-style: hardtop, wagon, sedan, hatchback, convertible. 
8. drive-wheels: 4wd, fwd, rwd. 
9. engine-location: front, rear. 
10. wheel-base: continuous from 86.6 120.9. 
11. length: continuous from 141.1 to 208.1. 
12. width: continuous from 60.3 to 72.3. 
13. height: continuous from 47.8 to 59.8. 
14. curb-weight: continuous from 1488 to 4066. 
15. engine-type: dohc, dohcv, l, ohc, ohcf, ohcv, rotor. 
16. num-of-cylinders: eight, five, four, six, three, twelve, two. 
17. engine-size: continuous from 61 to 326. 
18. fuel-system: 1bbl, 2bbl, 4bbl, idi, mfi, mpfi, spdi, spfi. 
19. bore: continuous from 2.54 to 3.94. 
20. stroke: continuous from 2.07 to 4.17. 
21. compression-ratio: continuous from 7 to 23. 
22. horsepower: continuous from 48 to 288. 
23. peak-rpm: continuous from 4150 to 6600. 
24. city-mpg: continuous from 13 to 49. 
25. highway-mpg: continuous from 16 to 54. 
26. price: continuous from 5118 to 45400.

--------

In [1]:
import pandas as pd

In [2]:
data_exc=pd.read_csv('Automobile.csv')

**Q.no(1). Check the head of the DataFrame.**

In [3]:
data_exc.head()

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
0,3,168,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,168,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,168,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.40,10.0,102,5500,24,30,13950
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.40,8.0,115,5500,18,22,17450

------------------

**Q.no(2). How many rows and columns are there.**

In [4]:
data_exc.shape

(201, 26)

201 rows and 26 columns

In [5]:
data_exc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 201 entries, 0 to 200
Data columns (total 26 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   symboling            201 non-null    int64
 1   normalized_losses    201 non-null    int64
 2   make                 201 non-null    object
 3   fuel_type            201 non-null    object
 4   aspiration           201 non-null    object
 5   number_of_doors      201 non-null    object
 6   body_style           201 non-null    object
 7   drive_wheels         201 non-null    object
 8   engine_location      201 non-null    object
 9   wheel_base           201 non-null    float64
 10  length               201 non-null    float64
 11  width                201 non-null    float64
 12  height               201 non-null    float64
 13  curb_weight          201 non-null    int64
 14  engine_type          201 non-null    object
 15  number_of_cylinders  201 non-null    object
 16  engine_size          201 non-null    int64
 17  fuel_system          201 non-null    object
 18  bore                 201 non-null    float64
 19  stroke               201 non-null    float64
 20  compression_ratio    201 non-null    float64
 21  horsepower           201 non-null    int64
 22  peak_rpm             201 non-null    int64
 23  city_mpg             201 non-null    int64
 24  highway_mpg          201 non-null    int64
 25  price                201 non-null    int64
dtypes: float64(7), int64(9), object(10)
memory usage: 41.0+ KB

---------------------

**Q.no(3). What is the average Price of all cars in the dataset.**

In [6]:
data_exc.groupby('make')['price'].mean()

make
alfa-romero      15498.333333
audi             17859.166667
bmw              26118.750000
chevrolet         6007.000000
dodge             7875.444444
honda             8184.692308
isuzu             8916.500000
jaguar           34600.000000
mazda            10652.882353
mercedes-benz    33647.000000
mercury          16503.000000
mitsubishi        9239.769231
nissan           10415.666667
peugot           15489.090909
plymouth          7963.428571
porsche          31400.500000
renault           9595.000000
saab             15223.333333
subaru            8541.250000
toyota            9885.812500
volkswagen       10077.500000
volvo            18063.181818
Name: price, dtype: float64

In [7]:
#Can also be done like this
group_data= data_exc.groupby('make')
group_data['price'].mean()

make
alfa-romero      15498.333333
audi             17859.166667
bmw              26118.750000
chevrolet         6007.000000
dodge             7875.444444
honda             8184.692308
isuzu             8916.500000
jaguar           34600.000000
mazda            10652.882353
mercedes-benz    33647.000000
mercury          16503.000000
mitsubishi        9239.769231
nissan           10415.666667
peugot           15489.090909
plymouth          7963.428571
porsche          31400.500000
renault           9595.000000
saab             15223.333333
subaru            8541.250000
toyota            9885.812500
volkswagen       10077.500000
volvo            18063.181818
Name: price, dtype: float64

In [13]:
#data_exc['price'].mean()

13207.129353233831

In [20]:
pd.pivot_table(data_exc,values=['price'],columns=['make'],aggfunc='mean')

make,alfa-romero,audi,bmw,chevrolet,dodge,honda,isuzu,jaguar,mazda,mercedes-benz,...,nissan,peugot,plymouth,porsche,renault,saab,subaru,toyota,volkswagen,volvo
price,15498.333333,17859.166667,26118.75,6007.0,7875.444444,8184.692308,8916.5,34600.0,10652.882353,33647.0,...,10415.666667,15489.090909,7963.428571,31400.5,9595.0,15223.333333,8541.25,9885.8125,10077.5,18063.181818

-------------------------------

**Q.no(4). Which is the cheapest make and most expensive make of car in the lot.**

In [16]:
# data_exc.sort_values(by='price')[['make','price']].head(1)
# data_exc.sort_values(by='price')[['make','price']].tail(1)
#Can also be done like this

In [14]:
data_exc[data_exc['price']==data_exc['price'].min()][['make','price']]

       make  price
134  subaru   5118

In [11]:
min_price=data_exc['price'].min()
data_exc[data_exc['price']==min_price][['make','price']]

       make  price
134  subaru   5118

In [15]:
data_exc[data_exc['price']==data_exc['price'].max()][['make','price']]

             make  price
71  mercedes-benz  45400

**Q.no(5). How many cars have horsepower greater than 100.**

In [9]:
data_exc[data_exc['horsepower']>100]['make'].count()

#they have asked for counts so we use only like above
# data_exc[data_exc['horsepower']>100]

90

In [15]:
data_exc[data_exc['horsepower']>100].value_counts()

AttributeError: 'DataFrame' object has no attribute 'value_counts'

----------------

**Q.no(6). How many hatchback cars are in the dataset .**

In [17]:
data_exc[data_exc['body_style']== 'hatchback']['body_style'].count()

#Use another column name so we would get count only once or all the columns with count will appear

68

In [19]:
#data_exc[data_exc['body_style']== 'hatchback'].count()['body_style']

In [20]:
data_exc['body_style'].value_counts()

#for getting count of all values for body style and verifying it whether value is correct

sedan          94
hatchback      68
wagon          25
hardtop         8
convertible     6
Name: body_style, dtype: int64

-------------------

**Q.no(7). What are the 3 most commonly found cars in the dataset?**

In [21]:
data_exc['make'].value_counts().head(3)

#data_exc['make'].value_counts()[0:3]

toyota    32
nissan    18
mazda     17
Name: make, dtype: int64

-----

**Q.no(8). Someone purchased a car for 7099, what is the make of the car?**

In [22]:
data_exc[data_exc['price']==7099]['make']

87    nissan
Name: make, dtype: object

In [23]:
#Can also be done like below
# data_exc['make'][data_exc['price']==7099]

# a=data_exc[data_exc['price']==7099]
# a['make']

-------------

**Q.no(9). Which cars are priced greater than 40000.**

In [24]:
data_exc[data_exc['price']>40000]['make']

15              bmw
70    mercedes-benz
71    mercedes-benz
Name: make, dtype: object

In [25]:
data_exc[data_exc['price']>40000]['make'].unique()
#Tried using unique bcoz we have a repeated value

array(['bmw', 'mercedes-benz'], dtype=object)

---

**Q.no(10).Which are the cars that have body style as sedan and priced less than 7000??**

In [26]:
data_exc[(data_exc['body_style']=='sedan') & (data_exc['price']<7000)]['make']

19      chevrolet
24          dodge
42          isuzu
50          mazda
82     mitsubishi
86         nissan
88         nissan
89         nissan
118      plymouth
152        toyota
Name: make, dtype: object

---------------

**Q.no(11) Show the prices of cars in ascending order.**

In [31]:
# data_exc.sort_values(by='price')
# data_exc['price'].sort_values()

#just tried this for filtering the values

In [11]:
data_exc.sort_values(by='price')[['make','price']] 
#Default is ascending so didnt declare it

              make  price
134         subaru   5118
17       chevrolet   5151
47           mazda   5195
146         toyota   5348
73      mitsubishi   5389
..             ...    ...
16             bmw  36880
125        porsche  37028
70   mercedes-benz  40960
15             bmw  41315
71   mercedes-benz  45400

[201 rows x 2 columns]

In [32]:
data_exc.sort_values(by='price',ascending=True)[['make','price']] 
#If we want for better uderstanding we can declare it but will not make any changes in op

              make  price
134         subaru   5118
17       chevrolet   5151
47           mazda   5195
146         toyota   5348
73      mitsubishi   5389
..             ...    ...
16             bmw  36880
125        porsche  37028
70   mercedes-benz  40960
15             bmw  41315
71   mercedes-benz  45400

[201 rows x 2 columns]

--------

**Q.no(12).Show the prices of the cars in descending order.**

In [34]:
#data_exc.sort_values(by='price',ascending=False)
#For checking descending order

In [35]:
data_exc.sort_values(by='price',ascending=False)[['make','price']]

              make  price
71   mercedes-benz  45400
15             bmw  41315
70   mercedes-benz  40960
125        porsche  37028
16             bmw  36880
..             ...    ...
73      mitsubishi   5389
146         toyota   5348
47           mazda   5195
17       chevrolet   5151
134         subaru   5118

[201 rows x 2 columns]

----------------

**Q.no(12).What is the rank order of the cars as per there horsepower.**

In [43]:
data_exc['horsepower_rank']=data_exc['horsepower'].rank()
data_exc.head(2) #Will create a new one at last of the table so that we can make use of it to filter the make also.

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price,horsepower_rank
0,3,168,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,mpfi,3.47,2.68,9.0,111,5000,21,27,13495,133.5
1,3,168,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,mpfi,3.47,2.68,9.0,111,5000,21,27,16500,133.5

In [44]:
data_exc.columns

Index(['symboling', 'normalized_losses', 'make', 'fuel_type', 'aspiration',
       'number_of_doors', 'body_style', 'drive_wheels', 'engine_location',
       'wheel_base', 'length', 'width', 'height', 'curb_weight', 'engine_type',
       'number_of_cylinders', 'engine_size', 'fuel_system', 'bore', 'stroke',
       'compression_ratio', 'horsepower', 'peak_rpm', 'city_mpg',
       'highway_mpg', 'price', 'horsepower_rank'],
      dtype='object')

In [45]:
data_exc[['horsepower_rank','make']]

     horsepower_rank         make
0              133.5  alfa-romero
1              133.5  alfa-romero
2              175.0  alfa-romero
3              120.0         audi
4              144.0         audi
..               ...          ...
196            140.5        volvo
197            182.0        volvo
198            162.0        volvo
199            123.0        volvo
200            140.5        volvo

[201 rows x 2 columns]

---------------------

**Q.no(13).What is the rank order of the cars as per there minimum prices.**

In [55]:
data_exc['min_price_rank']=data_exc['price'].rank(method='min')
data_exc[['min_price_rank','make']]

     min_price_rank         make
0             130.0  alfa-romero
1             150.0  alfa-romero
2             150.0  alfa-romero
3             136.0         audi
4             162.0         audi
..              ...          ...
196           157.0        volvo
197           175.0        volvo
198           179.0        volvo
199           181.0        volvo
200           182.0        volvo

[201 rows x 2 columns]

In [63]:
#for just checking only the rank using minimum 
data_exc['price'].rank(method='min')

0      130.0
1      150.0
2      150.0
3      136.0
4      162.0
       ...
196    157.0
197    175.0
198    179.0
199    181.0
200    182.0
Name: price, Length: 201, dtype: float64

------

**Q.no(14).What is the rank order of the cars as per there maximum prices.**

In [58]:
data_exc['max_price_rank']=data_exc['price'].rank(method='max')
data_exc[['max_price_rank','make']]

     max_price_rank         make
0             130.0  alfa-romero
1             151.0  alfa-romero
2             151.0  alfa-romero
3             136.0         audi
4             162.0         audi
..              ...          ...
196           157.0        volvo
197           175.0        volvo
198           179.0        volvo
199           181.0        volvo
200           182.0        volvo

[201 rows x 2 columns]

In [66]:
#for just checking only the rank using maximum 
data_exc['price'].rank(method='max')

0      130.0
1      151.0
2      151.0
3      136.0
4      162.0
       ...
196    157.0
197    175.0
198    179.0
199    181.0
200    182.0
Name: price, Length: 201, dtype: float64

-------------

**Q.no(15).What is the dense rank order of the cars as per there horsepower.**

In [70]:
data_exc['Dense_Rank']=data_exc['horsepower'].rank(method='dense')

In [72]:
data_exc[['horsepower','Dense_Rank']]

     horsepower  Dense_Rank
0           111        31.0
1           111        31.0
2           154        46.0
3           102        28.0
4           115        34.0
..          ...         ...
196         114        33.0
197         160        49.0
198         134        39.0
199         106        29.0
200         114        33.0

[201 rows x 2 columns]

--------------

**Q.no(16). Write a code to display the variable `make` and `price` of `5,6,10` rows.**

In [36]:
data_exc.loc[[4,5,9],['make','price']]

#rows starts with 0 so 5,6,10 means rows 4,5,9

    make  price
5   audi  15250
6   audi  17710
10   bmw  16925

In [37]:
#another option and its through normal location and index location
#Both gives same op
data_exc[['make','price']].iloc[[4,5,9]]

   make  price
4  audi  17450
5  audi  15250
9   bmw  16430

In [19]:
data_exc.iloc[[4,5,9],[2,25]]

   make  price
4  audi  17450
5  audi  15250
9   bmw  16430

------

**Q.no(17). Write a code to display the  `first five columns` and  `5 to 10 rows` using as per `index position`.**

In [67]:
data_exc.iloc[4:10,:5]

   symboling  normalized_losses  make fuel_type aspiration
4          2                164  audi       gas        std
5          2                161  audi       gas        std
6          1                158  audi       gas        std
7          1                168  audi       gas        std
8          1                158  audi       gas      turbo
9          2                192   bmw       gas        std

------------------------------------

# ----------------------------------HAPPY LEARNING----------------------------------------

-------